app/views/dashboard/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        <div class="span11 offset1">
            You currently have no messages :(
        </div>
    <% else %>
        <% @messages_to_display.each do |message| %>
            <ol class="span11 offset1">
                <li>
                <% if message.from_user_id.eql? current_user.id %>
                    <b><%= User.find_by_id(message.to_user_id).name %>:</b>
                <% else %>
                    <b><%= User.find_by_id(message.from_user_id).name %>:</b>
                <% end %>
                <%= message.created_at.time.to_date %>
                <br />
                <%= link_to(message) do %>
                    <%= message.body %>
                <% end %><br />
                </li>
            </ol>
            <div class="span4">
                <% if message.from_user_id.eql? current_user.id %>
                    <h1><%= CompatibilityAlgorithm.get_score(current_user.id, message.to_user_id).to_i %>% <small>Roompatible</small></h1>