app/views/messages/show.html.erb

                <% @view_conversation.each do |message| %>
                    <b><%= User.find_by_id(message.from_user_id).name %>:</b>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1