app/views/rooms/index.html.erb

            <div class="room-list-description"><%= room.description %></div>
            <% if room.location.present? %>
---
SELECT "locations".* FROM "locations" WHERE "locations"."room_id" = 1 LIMIT 1