app/views/rooms/show.html.erb

    <div class="clearfix">
        <% if @room.assets.present? %>
---
SELECT "assets".* FROM "assets" WHERE "assets"."room_id" = 1