app/controllers/dashboard_controller.rb

    def index
        @current_user_rooms = Room.find_all_by_user_id(current_user.id)
        @current_user_roommates = Roommate.find_all_by_user_id(current_user.id)
        @messages_received = Message.find_all_by_to_user_id(current_user.id)
        if @messages_received
            @current_user_conversations = Array.new
            @messages_received.each do |message|
                @current_user_conversations.push message.conversation_id
                @current_user_unique_conversations = @current_user_conversations.uniq
            end
        end
        @messages_to_display = Array.new
        if @current_user_unique_conversations
            @current_user_unique_conversations.each do |id|
                current_message = Message.find_last_by_conversation_id(id)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = 1
SELECT "roommates".* FROM "roommates" WHERE "roommates"."user_id" = 1
SELECT "messages".* FROM "messages" WHERE "messages"."to_user_id" = 1
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 1 ORDER BY "messages"."id" DESC LIMIT 1