app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 1
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = 1 AND "messages"."to_user_id" = 1
SELECT "quiz_attempts".* FROM "quiz_attempts" WHERE "quiz_attempts"."user_id" = 1 LIMIT 1
SELECT "quiz_attempt_responses".* FROM "quiz_attempt_responses" WHERE "quiz_attempt_responses"."quiz_attempt_id" = 1
---
    def show
        @current_message = Message.find_by_id(params["id"])
        @current_message_conversation_id = @current_message.conversation_id
        @message_reply_to_user_id = @current_message.from_user_id
        if @message_reply_to_user_id.eql? current_user.id
            @message_reply_to_user_id = @current_message.to_user_id
        end
        @view_conversation = Message.find_all_by_conversation_id(@current_message_conversation_id)
        @view_conversation = @view_conversation.sort_by{|e| e.created_at}.reverse

        @messages_to_current_user = Message.find_all_by_to_user_id_and_conversation_id(current_user.id, @current_message_conversation_id)
        @messages_to_current_user.each do |msg|
            msg.last_read_timestamp = Time.new
            begin
                msg.save!
            rescue
            end
        end

        if current_user
            @user_1 = current_user.id
            @user_2 = @message_reply_to_user_id
        end
            @score = CompatibilityAlgorithm.get_score(@user_1, @user_2).to_i
            @same_quiz = CompatibilityAlgorithm.same_quiz_test(@user_1, @user_2)
            @all_questions_id = CompatibilityAlgorithm.all_questions_id(@same_quiz)
            @all_traits_id = CompatibilityAlgorithm.all_traits_id(@all_questions_id).uniq

            @user_1_last_quiz_attempt = QuizAttempt.find_all_by_user_id(@user_1).last
            @user_2_last_quiz_attempt = QuizAttempt.find_all_by_user_id(@user_2).last
            @user_1_responses = QuizAttemptResponse.find_all_by_quiz_attempt_id(@user_1_last_quiz_attempt)

SELECT "messages".* FROM "messages" WHERE "messages"."to_user_id" = 1 AND "messages"."from_user_id" = 2
---
    def message_sent
        @from_user_id = params["from_user_id"]
        @to_user_id = params["to_user_id"]
        @body = params["body"]
        @current_user_has_already_initiated_a_conversation_with_room_user = Message.find_all_by_from_user_id_and_to_user_id(@from_user_id, @to_user_id)