app/controllers/rooms_controller.rb

    def index
            @rooms = Room.find_all_by_room_active('t')
        if params[:search].present?
            @locations = Location.near(params[:search], 10, :order => :distance)
            @nearby_rooms = Array.new
            @locations.each do |location|
                room_id = location.room_id
                @nearby_rooms.push room_id
            end
            @nearby_rooms = @nearby_rooms.uniq
            @rooms = Room.find_all_by_id(@nearby_rooms)
        else
		@rooms = @rooms
        end

        @rooms = @rooms.sort_by{|e| e.updated_at}.reverse
        @rooms = Kaminari.paginate_array(@rooms).page(params[:page]).per(10)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."room_active" = 't'
SELECT "locations".* FROM "locations" WHERE "locations"."room_id" = 1 LIMIT 1
SELECT "rooms".* FROM "rooms"

    def show
        @room = Room.find(params[:id])
        if @room.address.present?
            @room_location = Location.find_all_by_room_id(@room.id).last
            @city = @room_location.city
            #@json = @room_location.to_gmaps4rails
            #add this to views room show: <%= gmaps4rails(@json) %>
            @circles_json = @room_location.to_gmaps4rails.chop.chop + ", \"radius\": 100}]"

        end

        if current_user
            @user_1 = current_user.id
            @user_2 = @room.user_id
            @score = CompatibilityAlgorithm.get_score(@user_1, @user_2).to_i
            @same_quiz = CompatibilityAlgorithm.same_quiz_test(@user_1, @user_2)
            @all_questions_id = CompatibilityAlgorithm.all_questions_id(@same_quiz)
            @all_traits_id = CompatibilityAlgorithm.all_traits_id(@all_questions_id).uniq

            @user_1_last_quiz_attempt = QuizAttempt.find_all_by_user_id(@user_1).last
            @user_2_last_quiz_attempt = QuizAttempt.find_all_by_user_id(@user_2).last
            @user_1_responses = QuizAttemptResponse.find_all_by_quiz_attempt_id(@user_1_last_quiz_attempt)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "locations".* FROM "locations" WHERE "locations"."room_id" = 1
SELECT "quiz_attempts".* FROM "quiz_attempts" WHERE "quiz_attempts"."user_id" = 1 LIMIT 1
SELECT "quiz_attempt_responses".* FROM "quiz_attempt_responses" WHERE "quiz_attempt_responses"."quiz_attempt_id" = 1

    def edit

        @pictures_uploaded = @room.assets.count
---
SELECT COUNT(*) FROM "assets" WHERE "assets"."room_id" = 1

    def create
        @room = Room.new(params[:room])
        @room.user = current_user

        @price_per_week_month = ["Monthly", "Weekly"]
        @desired_gender = ["Male or Female", "Male", "Female"]
        @desired_length_of_stay_number = [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
        @desired_length_of_stay_week_month = ["Months", "Weeks"]
        @desired_length_of_stay_more_less = ["or more", "or less"]

        respond_to do |format|
            if @room.save
---
INSERT INTO "rooms" ("address", "amenities_ac", "amenities_backyard", "amenities_balcony", "amenities_cable_tv", "amenities_elevator", "amenities_heater", "amenities_internet", "amenities_kitchen", "amenities_rooftop", "amenities_washer", "contact_info", "couples_allowed", "created_at", "description", "desired_gender", "desired_length_of_stay_more_less", "desired_length_of_stay_number", "desired_length_of_stay_week_month", "desired_move_in_date", "pets_allowed", "pets_on_premise", "price", "price_per_week_month", "room_active", "smoking_allowed", "smoking_on_premise", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @price_per_week_month = ["Monthly", "Weekly"]
        @desired_gender = ["Male or Female", "Male", "Female"]
        @desired_length_of_stay_number = [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
        @desired_length_of_stay_week_month = ["Months", "Weeks"]
        @desired_length_of_stay_more_less = ["or more", "or less"]

        respond_to do |format|
            if @room.update_attributes(params[:room])
---
UPDATE "rooms" SET "updated_at" = '2012-01-04 00:41:26.576057', "room_active" = 't' WHERE "rooms"."id" = 1