app/controllers/roommates_controller.rb

def index
    @roommates = Roommate.find_all_by_roommate_active('t')
    @roommates = @roommates.sort_by{|e| e.updated_at}.reverse
    @roommates = Kaminari.paginate_array(@roommates).page(params[:page]).per(10)
---
SELECT "roommates".* FROM "roommates" WHERE "roommates"."roommate_active" = 't'
SELECT "roommates".* FROM "roommates"

  def show
    @roommate = Roommate.find(params[:id])

        if current_user
            @user_1 = current_user.id
            @user_2 = @roommate.user_id
            @score = CompatibilityAlgorithm.get_score(@user_1, @user_2).to_i
            @same_quiz = CompatibilityAlgorithm.same_quiz_test(@user_1, @user_2)
            @all_questions_id = CompatibilityAlgorithm.all_questions_id(@same_quiz)
            @all_traits_id = CompatibilityAlgorithm.all_traits_id(@all_questions_id).uniq

            @user_1_last_quiz_attempt = QuizAttempt.find_all_by_user_id(@user_1).last
            @user_2_last_quiz_attempt = QuizAttempt.find_all_by_user_id(@user_2).last
            @user_1_responses = QuizAttemptResponse.find_all_by_quiz_attempt_id(@user_1_last_quiz_attempt)
---
SELECT "roommates".* FROM "roommates" WHERE "roommates"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "quiz_attempts".* FROM "quiz_attempts" WHERE "quiz_attempts"."user_id" = 1 LIMIT 1
SELECT "quiz_attempt_responses".* FROM "quiz_attempt_responses" WHERE "quiz_attempt_responses"."quiz_attempt_id" = 1

  def create
    @roommate = Roommate.new(params[:roommate])
    @roommate.user = current_user

    @desired_gender = ["Male or Female", "Male", "Female"]
    @gender = ["Male", "Female"]
    @sexual_orientation = ["Straight", "Bisexual", "Gay", ""]
    @max_renters = [2, 1, 3, 4]

    respond_to do |format|
      if @roommate.save
---
INSERT INTO "roommates" ("about", "age", "created_at", "desired_gender", "desired_living_area", "desired_move_in_date", "does_smoke", "gender", "has_pets", "max_renters", "name", "rent", "roommate_active", "sexual_orientation", "updated_at", "user_id", "willing_to_live_with_pets", "willing_to_live_with_smoker") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update

    @desired_gender = ["Male or Female", "Male", "Female"]
    @gender = ["Male", "Female"]
    @sexual_orientation = ["Straight", "Bisexual", "Gay", ""]
    @max_renters = [2, 1, 3, 4]


    respond_to do |format|
      if @roommate.update_attributes(params[:roommate])
---
UPDATE "roommates" SET "updated_at" = '2012-01-04 00:56:07.879131', "roommate_active" = 'f' WHERE "roommates"."id" = 1