app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "nickname", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."uid" = '292743631' AND "users"."provider" = 'twitter' LIMIT 1
---
    def create
        auth = request.env["omniauth.auth"]
        user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)