app/controllers/take_controller.rb

    def new
        @last_quiz = Quiz.last
        @quiz_attempt = @last_quiz
        @form_questions = Question.find_all_by_quiz_id(@quiz_attempt.id)
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = 1

    def complete
        @has_errors = false
        @current_user = current_user
        @current_user_name = @current_user.name

        @new_quiz_attempt = QuizAttempt.new
            @new_quiz_attempt.user_id = current_user.id
            @new_quiz_attempt.quiz_id = params['quiz_attempt_id']
             begin
                @new_quiz_attempt.save!
            rescue
            end

        @question = params['question']
        @question.keys.each do |key|
            question_id = key
            result = @question[key]
            response = QuizAttemptResponse.new
            response.question_id = key
            response.value = result
            response.quiz_attempt_id = @new_quiz_attempt.id
            begin
                response.save!
---
INSERT INTO "quiz_attempts" ("created_at", "quiz_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 27 Dec 2011 20:03:35 UTC +00:00], ["quiz_id", 1], ["updated_at", Tue, 27 Dec 2011 20:03:35 UTC +00:00], ["user_id", 1]]
INSERT INTO "quiz_attempt_responses" ("created_at", "question_id", "quiz_attempt_id", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 27 Dec 2011 20:03:35 UTC +00:00], ["question_id", 6], ["quiz_attempt_id", 1], ["updated_at", Tue, 27 Dec 2011 20:03:35 UTC +00:00], ["value", "a"]]